/***************************************************************
 * Biblioteca de Controle de Potência                          *
 ***************************************************************/
 
 /* Autor: Felipe Antonio Montagneri Lucchini
    Data : 05/04/2016
	*/
	
/***************************************************************/

#include "stm8s.h"

/***************************************************************
 * Funções e Procedimentos                                     *
 ***************************************************************/
/***************************************************************
 * powerControl(rate);                                         *
 *                                                             *
 * Procedimento de controle de Potência;                       *
 *                                                             *
 * uint8_t -> quantidade de cliclos ativos;                    *
 *                                                             *
 * void -> não retorna valor;                                  *
 ***************************************************************/
void powerControl(uint16_t rate);

/***************************************************************
 * powerOff();                                                 *
 *                                                             *
 * Procedimento de corte de energia;                           *
 *                                                             *
 * void -> não recebe parâmetros;                              *
 *                                                             *
 * void -> não retorna valor;                                  *
 ***************************************************************/
void powerOff(void);

/***************************************************************/